import os


if __name__ == '__main__':
    ####################################################################################################
    """
        需要用户手动输入参数
        @task_num:任务个数
        @equip_num:虚拟机配置个数
    """
    task_num = 30       # 任务数量

    vm_num = 15             # 虚拟机数量
    cpu_max = 4             # 虚拟机CPU
    mem_max = 16            # 虚拟机内存

    # deadline的比例
    propor = 0.6

    MEM = [1, 2, 3, 4, 8, 16]
    CPU = 4

    # 具体的TET对应的配置
    equips = [[1, 1], [1, 2], [1, 3], [1, 4], [1, 8], [1, 16],
              [2, 1], [2, 2], [2, 3], [2, 4], [2, 8], [2, 16],
              [3, 1], [3, 2], [3, 3], [3, 4], [3, 8], [3, 16],
              [4, 1], [4, 2], [4, 3], [4, 4], [4, 8], [4, 16]]

    # CPU占比
    PORPRO = 0.5
    ####################################################################################################
    # 判断是否存在输入输出目录
    if (not os.path.exists('./input')) or len(os.listdir('./input')) == 0:
        print('程序没有输入！')
        os.mkdir('./input')
        exit()
    if not os.path.exists('./output'):
        os.mkdir('./output')


